tap 'caskroom/cask'

  brew 'asciinema'
  brew 'autoconf'
  brew 'automake'
  brew 'awscli'
  brew 'bat'
  brew 'coreutils'
  brew 'findutils'
  brew 'gawk'
  brew 'gdbm'
  brew 'git'
  brew 'gmp'
  brew 'gnu-getopt'
  brew 'gnu-indent'
  brew 'gnu-sed'
  brew 'gnu-tar'
  brew 'gnutls'
  brew 'golang'
  brew 'grep'
  brew 'htop'
  brew 'httpie'
  brew 'hub'
  brew 'jq'
  brew 'libksba'
  brew 'libtool'
  brew 'libyaml'
  brew 'lsd'
  brew 'node'
  brew 'npm'
  brew 'nvm'
  brew 'openssl'
  brew 'pipenv'
  brew 'pkg-config'
  brew 'pyenv'
  brew 'rbenv'
  brew 'readline'
  brew 'reattach-to-user-namespace'
  brew 'the_silver_searcher'
  brew 'terraform'
  brew 'tmux'
  brew 'tree'
  brew 'vim'
  brew 'wget'
  brew 'yarn'
  brew 'zplug'
  brew 'zsh'
  brew 'zsh-syntax-highlighting'
  cask 'vlc'

tap 'remind101/formulae'
  brew 'assume-role'

mas '1Password', id:  443987910
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'Cappuccino', id: 1286725949
mas 'Fantastical', id: 975937182
mas 'GarageBand', id:  682658836
mas 'Keynote', id: 409183694
mas 'MindNode', id: 992076693
mas 'NordVPN IKE', id:  1116599239
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paste', id: 967805235
mas 'Proxie', id:  897814548
mas 'Reeder', id: 1449412482
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Textual IRC Client', id: 1262957439
mas 'Tweetbot', id: 1384080005
mas 'Wunderlist', id: 410628904
mas 'Xcode', id: 497799835
mas 'iMovie', id: 408981434
