
tap 'caskroom/cask'

# Core Homebrew
brew 'adns'
brew 'aom'
brew 'asciinema'
brew 'assume-role'
brew 'autoconf'
brew 'automake'
brew 'bat'
brew 'bats'
brew 'boost'
brew 'c-ares'
brew 'cairo'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'csvkit'
brew 'ctags'
brew 'diff-so-fancy'
brew 'doctl'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'findutils'
brew 'flac'
brew 'fontconfig'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'gawk'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'giflib'
brew 'gifsicle'
brew 'git'
brew 'git-crypt'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnutls'
brew 'go'
brew 'gotop'
brew 'gradle'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'grip'
brew 'gron'
brew 'groovy'
brew 'gts'
brew 'hadolint'
brew 'harfbuzz'
brew 'heroku'
brew 'heroku-node'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'hub'
brew 'icu4c'
brew 'jansson'
brew 'jasper'
brew 'jemalloc'
brew 'jenv'
brew 'jpeg'
brew 'jq'
brew 'json-c'
brew 'jsonlint'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libassuan'
brew 'libbluray'
brew 'libcouchbase'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn2'
brew 'libksba'
brew 'libmaxminddb'
brew 'libnet'
brew 'libogg'
brew 'libpng'
brew 'libsamplerate'
brew 'libsmi'
brew 'libsndfile'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libyaml'
brew 'libyubikey'
brew 'libzip'
brew 'little-cms2'
brew 'lsd'
brew 'lua'
brew 'lua@5.1'
brew 'lynx'
brew 'lzo'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mosh'
brew 'mpfr'
brew 'mtr'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'nomad'
brew 'npth'
brew 'nvm'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openjdk'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'packer'
brew 'pandoc'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pipenv'
brew 'pipx'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'protobuf'
brew 'pssh'
brew 'pstree'
brew 'pyenv'
brew 'python'
brew 'python@3.8'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-build'
brew 'sdl2'
brew 'shellcheck'
brew 'snappy'
brew 'source-highlight'
brew 'speex'
brew 'sqlite'
brew 'tcptraceroute'
brew 'telnet'
brew 'terraform-docs'
brew 'terraform_landscape'
brew 'tesseract'
brew 'tfenv'
brew 'tflint'
brew 'the_silver_searcher'
brew 'theora'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'unbound'
brew 'universal-ctags'
brew 'vim'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wireshark'
brew 'x264'
brew 'x265'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'ykman'
brew 'ykpers'
brew 'yq'
brew 'zlib'
brew 'zplug'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# Cask Apps
cask 'adoptopenjdk8'
cask 'aws-vault'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-go-mono-nerd-font-mono'
cask 'java'
cask 'java11'
cask 'java6'
cask 'pdk'
cask 'puppet-agent-5'
cask 'vlc'
cask 'wireshark'

# mas '1Password', id:  443987910
# mas 'Amphetamine', id: 937984704
# mas 'Bear', id: 1091189122
# mas 'Cappuccino', id: 1286725949
# mas 'Fantastical', id: 975937182
# mas 'GarageBand', id:  682658836
# mas 'Keynote', id: 409183694
# mas 'MindNode', id: 992076693
# mas 'NordVPN IKE', id:  1116599239
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
# mas 'Paste', id: 967805235
# mas 'Proxie', id:  897814548
# mas 'Slack', id: 803453959
# mas 'Spark', id: 1176895641
# mas 'Textual IRC Client', id: 1262957439
# mas 'Tweetbot', id: 1384080005
# mas 'Wunderlist', id: 410628904
# mas 'Xcode', id: 497799835
# mas 'iMovie', id: 408981434
