tap "common-fate/granted"
tap "fluxcd/tap"
tap "guessi/tap"
tap "home-operations/tap"
tap "kdash-rs/kdash"
tap "terraform-linters/tap"
tap "universal-ctags/universal-ctags"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Recompression utilities for .PNG, .MNG, .ZIP, and .GZ files
brew "advancecomp"
# Asciicast to GIF converter
brew "agg"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Text-based UI library
brew "ncurses"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# CLI utility for caching the output of subprocesses
brew "bkt"
# Collection of portable C++ source libraries
brew "boost"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Asynchronous DNS library
brew "c-ares"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# JSON parser for C
brew "json-c"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Tool for browsing source code
brew "cscope"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Command-line csv viewer
brew "csvlens"
# Reimplementation of ctags(1)
brew "ctags", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Command-line tool for DigitalOcean
brew "doctl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# VP8/VP9 video codec
brew "libvpx"
# Audio codec
brew "opus"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Library and utilities for processing GIFs
brew "giflib"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# TIFF library and utilities
brew "libtiff"
# Generic library support script
brew "libtool"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Minimalistic plugin API for video effects
brew "frei0r"
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Render markdown on the CLI
brew "glow"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Make JSON greppable
brew "gron"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Language server for Helm
brew "helm-ls"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Manage your Java environment
brew "jenv"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Command-line pager for JSON data
brew "jless"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Portable Foreign Function Interface library
brew "libffi"
# JSON parser and validator with a CLI
brew "jsonlint"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Flexible Kustomize Plugin for SOPS Encrypted Resources
brew "ksops"
# Colorize your kubectl output
brew "kubecolor"
# CloudNativePG plugin for kubectl
brew "kubectl-cnpg"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit", link: false
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Pager program similar to more
brew "less"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Convert pixel information into colored ASCII art
brew "libcaca"
# Asynchronous event library
brew "libev"
# Asynchronous event library
brew "libevent"
# C library for Couchbase
brew "libcouchbase"
# C library for the MaxMind DB file format
brew "libmaxminddb"
# C library for creating IP packets
brew "libnet"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Library to Access SMI MIB Information
brew "libsmi"
# Vorbis general audio compression codec
brew "libvorbis"
# C library for files containing sampled sound
brew "libsndfile"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Transcode video stabilization plugin
brew "libvidstab"
# C XSLT library for GNOME
brew "libxslt"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Run LogQL queries against a Loki server
brew "logcli"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Text-based web browser
brew "lynx"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# High performance, distributed memory object caching system
brew "memcached"
# CLI for Mermaid library
brew "mermaid-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Cross platform, open source .NET development framework
brew "mono"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Simple CLI for interacting with Google oauth tokens
brew "oauth2l"
# Command-line Git information tool
brew "onefetch"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# ProjectDiscovery's Open Source Tool Manager
brew "pdtm"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Command-line shell and scripting language
brew "powershell", link: false
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Tab completion for Python argparse
brew "python-argcomplete"
# File browser
brew "ranger", link: false
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Audio time stretcher tool and library
brew "rubberband"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Advanced console-based IP subnet calculator
brew "sipcalc"
# Automate your tmux workflow
brew "smug"
# Compression/decompression library aiming for high speed
brew "snappy"
# Editor of encrypted files
brew "sops"
# Source-code syntax highlighter
brew "source-highlight"
# Audio codec designed for speech
brew "speex"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Improve Terraform's plan output
brew "terraform_landscape"
# Generate Atlantis config for Terragrunt projects
brew "terragrunt-atlantis-config"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# CLI to print the summary of the terraform plan
brew "tf-summarize"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Open video compression format
brew "theora"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash"
# Parser generator tool
brew "tree-sitter-cli"
# Incremental parsing library
brew "tree-sitter@0.25"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Maintained ctags implementation
brew "universal-ctags"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Language Server for Yaml Files
brew "yaml-language-server"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The easiest way to access your cloud.
brew "common-fate/granted/granted", trusted: true
# Flux CLI
brew "fluxcd/tap/flux", trusted: true
# Retrieve Amazon EKS AMI with filters
brew "guessi/tap/eks-ami-finder", trusted: true
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# Terminal-based AI coding assistant
cask "claude-code"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Render and diff Flux GitOps repositories offline, without a cluster
cask "home-operations/tap/flate", trusted: true
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Command-line shell and scripting language
cask "powershell"
# Pluggable Terraform linter
cask "terraform-linters/tap/tflint", trusted: true
krew "cert-manager"
krew "cnpg"
krew "explore"
krew "get-all"
krew "node-shell"
krew "pod-lens"
krew "pod-shell"
krew "stern"
krew "tail"
krew "tree"
npm "live-server"
